Revit 2026 API

# ViewIsCategoryOverridable Method

---

Checks whether the category can have graphic overrides in this view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsCategoryOverridable(
	ElementId categoryId
)
```
```vb
Public Function IsCategoryOverridable (
	categoryId As ElementId
) As Boolean
```
```cpp
public:
bool IsCategoryOverridable(
	ElementId^ categoryId
)
```
```fsharp
member IsCategoryOverridable :
        categoryId : ElementId -> bool
```

#### Parameters

categoryId ElementId
     ElementId of the category.

#### Return Value

Boolean True if category can be overridden, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Categories can be allowed to be overridden in some view types and prohibited from being overridden in others. E.g., categories cannot be overridden in ProjectBrowser

#### Reference

View Class

Autodesk.Revit.DB Namespace